export type BlogPost = {
  id: number;
  title: string;
  date: string;
  summaryTitle: string;
  summary: string;
  fullTitle: string;
  fullTextTitle: string;
  fullText: string;
};

export const BLOG_POSTS: BlogPost[] = [
  {
    id: 1,
    title: "3 способа конвертации xlsx в xml",
    date: "2025-12-12",
    summaryTitle: "Краткое описание новости",
    summary:
      "Устали вручную переделывать прайс-листы для Яндекс.Маркета? Каждая ошибка в формате XML стоит вам времени и денег. В этом руководстве покажем 3 способа конвертации CSV в XML: от ручного до полностью автоматизированного. Выберите свой — и начните загружать товары уже сегодня.",
    fullTitle: "3 способа конвертации xlsx в xml",
    fullTextTitle: "Полное описание новости",
    fullText:
      "Устали вручную переделывать прайс-листы для Яндекс.Маркета? Каждая ошибка в формате XML стоит вам времени и денег. В этом руководстве покажем 3 способа конвертации CSV в XML: от ручного до полностью автоматизированного. Выберите свой — и начните загружать товары уже сегодня.\n\nТут шаги с картинками просто...",
  },
  {
    id: 2,
    title: "Iphones Feed",
    date: "2025-12-12",
    summaryTitle: "Краткое описание новости",
    summary:
      "https://www.feedodel.ru/feed/yfygnJgeAEm4a6RCXyr6O4/IP_Zyranov_Iphones_feed.xml",
    fullTitle: "Iphones Feed",
    fullTextTitle: "Полное описание новости",
    fullText:
      "Устали вручную переделывать прайс-листы для Яндекс.Маркета? Каждая ошибка в формате XML стоит вам времени и денег. В этом руководстве покажем 3 способа конвертации CSV в XML: от ручного до полностью автоматизированного. Выберите свой — и начните загружать товары уже сегодня.\n\nТут шаги с картинками просто...",
  },
  {
    id: 3,
    title: "Iphones Feed",
    date: "2025-12-12",
    summaryTitle: "Краткое описание новости",
    summary:
      "https://www.feedodel.ru/feed/yfygnJgeAEm4a6RCXyr6O4/IP_Zyranov_Iphones_feed.xml",
    fullTitle: "Iphones Feed",
    fullTextTitle: "Полное описание новости",
    fullText:
      "Устали вручную переделывать прайс-листы для Яндекс.Маркета? Каждая ошибка в формате XML стоит вам времени и денег. В этом руководстве покажем 3 способа конвертации CSV в XML: от ручного до полностью автоматизированного. Выберите свой — и начните загружать товары уже сегодня.\n\nТут шаги с картинками просто...",
  },
  {
    id: 4,
    title: "Iphones Feed",
    date: "2025-12-12",
    summaryTitle: "Краткое описание новости",
    summary:
      "https://www.feedodel.ru/feed/yfygnJgeAEm4a6RCXyr6O4/IP_Zyranov_Iphones_feed.xml",
    fullTitle: "Iphones Feed",
    fullTextTitle: "Полное описание новости",
    fullText:
      "Устали вручную переделывать прайс-листы для Яндекс.Маркета? Каждая ошибка в формате XML стоит вам времени и денег. В этом руководстве покажем 3 способа конвертации CSV в XML: от ручного до полностью автоматизированного. Выберите свой — и начните загружать товары уже сегодня.\n\nТут шаги с картинками просто...",
  },
];

